app/Controllers/Noticia.php

    public function getBorradores($idNoticia = 0, $offSet=0) {

        $noticia = $this->modeloNoticia->find($idNoticia);
---
SELECT *
FROM `noticia`
WHERE `noticia`.`id` = '27'

    public function misNoticias(){

        if ($this->session->has('id')) {

            if($this->session->has('esEditor') && $this->session->esEditor ==1){

                $noticias = $this->modeloNoticia->obtenerNoticiasUsuario($this->session->id);
                $cantidadBorradoresActivos = $this->modeloNoticia->obtenerCantidadNotciasActivasEnBorradorPorUsuario($this->session->id);

                //mapeamos para el contenido de la tabla
                $cabecera = ['T&iacute;tulo', 'Categor&iacute;a', 'Estado', 'Estatus', 'Fecha/estatus', 'Responsable/estatus',
                            'Editar','Borradores','Historial', 'Acci&oacute;n'];

                $contenidoNoticias = array_map(function($item) {
                    // Verificar si las variables están definidas
                    $titulo = isset($item['titulo']) ? esc($item['titulo']) : 'No disponible';
                    $categoria = isset($item['categoria']) ? esc($item['categoria']) : 'No disponible';
                    $estado = isset($item['estado']) ? esc($item['estado']) : 'No disponible';
                    $estatus = isset($item['es_activo']) ? esc($item['es_activo']) : 'No disponible';
                    $fecha = isset($item['fechaEstatus']) ? esc($item['fechaEstatus']) : 'No disponible';
                    $responsable = isset($item['correo']) ? esc($item['correo']) : 'No disponible';
                    $verBorradores = $this->verBorradores($item['id']);
                    $id = isset($item['id']) ? esc($item['id']) : 'No disponible';
                    return [$titulo, $categoria, $estado, $estatus, $fecha, $responsable,
                            $verBorradores, $id];
                }, $noticias);

                $estadoModelo = model(ModeloEstado::class);
                $estados = $estadoModelo->find([1,2]);
---
SELECT *
FROM `estado`
WHERE `estado`.`id` IN (1,2)

    public function editar($idNoticia){

        if(!$this->session->has('id')){
            return redirect()->to(base_url());
        }

        $noticia = $this->modeloNoticia->obtenerNoticias($idNoticia);

        if(empty($noticia)){
            throw new PageNotFoundException('No se encontro la noticia '.$idNoticia);
        }

        if($noticia['id_estado'] != 2 && $noticia['id_estado'] != 10 ){  // no se pueden editar noticias que no cumplan la condición
            $mensaje = "¡Operación no permitida!";
            $this->session->setFlashdata('mensaje', $mensaje);
            return redirect()->to('noticia/mis_noticias');
        }

        $estadoModelo = model(ModeloEstado::class);
        $estados = $estadoModelo->find([1,2,12,13]);
---
SELECT *
FROM `estado`
WHERE `estado`.`id` IN (1,2,12,13)

    public function nueva(){

        if(!$this->session->has('id')){
            return redirect()->to(base_url());
        }

        $estadoModelo = model(ModeloEstado::class);
        $estados = $estadoModelo->find([1,2]);
---
SELECT *
FROM `estado`
WHERE `estado`.`id` IN (1,2)

    public function detalleNoticiaParaValidar($idNoticia){
        //detalleNoticiaParaValidar

        if(!$this->session->has('id')){
            return redirect()->to(base_url());
        }

        $noticia = $this->modeloNoticia->obtenerNoticias($idNoticia);

        if(empty($noticia)){
            throw new PageNotFoundException('No se encontro la noticia '.$idNoticia);
        }

        if(!($noticia['id_estado'] == 1 || ($noticia['id_estado'] == 5 && $noticia['id_usuario'] == 1))){
            $mensaje = "¡Operación no permitida!";
            $this->session->setFlashdata('mensaje', $mensaje);
            return redirect()->to('noticia/validar');
        }


        $estadoModelo = model(ModeloEstado::class);

        $cantidadVecesEnEstadoValidar = $this->modeloNoticia->obtenerCantindadVcesEnEstadoValidar($noticia['id']);
        if ($noticia['id_estado'] == 1){
            if($cantidadVecesEnEstadoValidar > 1){
                $estados = $estadoModelo->find([5,10]);
            } else{
                $estados = $estadoModelo->find([5,9,10]);
            }
        }else {
            $estados = $estadoModelo->find([6,10]);
---
SELECT *
FROM `estado`
WHERE `estado`.`id` IN (5,10)
SELECT *
FROM `estado`
WHERE `estado`.`id` IN (6,10)

    public function postDetalleNoticiaParaValidar(){

        if(!$this->session->has('id')){
            return redirect()->to(base_url());
        }

        $data = $this->request->getPost(['id', 'estado', 'observaciones']);

        $validation = \Config\Services::validation();
        $validation->setRules([
            'estado' => 'required',
        ]);

        if (! $validation->run($data)) {
            return $this->detalleNoticiaParaValidar($data['id']);
        }
        $datosValidados = $validation->getValidated();

        $modeloEstadoNoticia = model(ModeloEstadoNoticia::class);
        $modeloEstadoNoticia->save([
            'id_noticia'=> $data['id'],
            'id_estado'=> $data['estado'],
            'observaciones'=> $data['observaciones'],
            'id_usuario'=> $this->session->id,
        ]);
---
INSERT INTO `estado_noticia` (`id_noticia`, `id_estado`, `observaciones`, `id_usuario`) VALUES ('50', '5', '                             \r\n                ', '35')