app/Models/ModeloNoticia.php

SELECT COUNT(*) as cantidad
FROM `estado_noticia`
WHERE `estado_noticia`.`id_estado` = 1
AND `estado_noticia`.`id_noticia` = '36'
---
        public function obtenerCantindadVcesEnEstadoValidar($id){
            $noticia =  $this->db->table($this->tablaEstadoNoticia)
                   ->where('estado_noticia.id_estado = 1')
                   ->where('estado_noticia.id_noticia', $id)
                   ->select('COUNT(*) as cantidad')
                   ->get()->getRow();

SELECT `noticia`.`id` as `id`, `noticia`.`es_activo`, `borrador`.`fecha_modificacion` as `fechaBorrador`, `borrador`.`titulo`, `borrador`.`descripcion`, `borrador`.`id` as `id_borrador`, `borrador`.`imagen`, `categoria`.`nombre` as `categoria`, `borrador`.`id_categoria`, `estado_noticia`.`fecha`, `usuario`.`correo`
FROM `noticia`
JOIN `usuario` ON `noticia`.`id_usuario` = `usuario`.`id`
JOIN `borrador` ON `noticia`.`id` = `borrador`.`id_noticia`
JOIN `categoria` ON `borrador`.`id_categoria` = `categoria`.`id`
JOIN `estado_noticia` ON `noticia`.`id` = `estado_noticia`.`id_noticia`
WHERE `es_activo` = 1
AND fecha = (SELECT MAX(fecha) 
                            FROM estado_noticia 
                            WHERE estado_noticia.id_noticia = noticia.id)
                            
AND `id_estado` = 5
AND `borrador`.`id_categoria` = '7'
GROUP BY `noticia`.`id`
ORDER BY `fecha` DESC
---
        public function obtenerNoticiasEstadoPublicada($idCategoria=0){

            $subconsulta = '(SELECT MAX(fecha)
                            FROM estado_noticia
                            WHERE estado_noticia.id_noticia = noticia.id)
                            ';

            $campos =  'noticia.id as id,
                        noticia.es_activo,
                        borrador.fecha_modificacion as fechaBorrador,
                        borrador.titulo,
                        borrador.descripcion,
                        borrador.id as id_borrador,
                        borrador.imagen,
                        categoria.nombre as categoria,
                        borrador.id_categoria,
                        estado_noticia.fecha,
                        usuario.correo ';



            $noticia =  $this->db->table($this->table)
            ->join("usuario","noticia.id_usuario = usuario.id")
            ->join("borrador", "noticia.id = borrador.id_noticia")
            ->join('categoria',"borrador.id_categoria = categoria.id")
            ->join('estado_noticia',"noticia.id = estado_noticia.id_noticia")
            ->where("es_activo = 1")
            ->where("fecha = $subconsulta")
            ->where( "id_estado",  5) ;